app/controllers/admin/users_controller.rb

  def index
   @user = User.all.page(params[:page]).per(5)
---
SELECT "users".* FROM "users" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"

  def edit
    @silly = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "users" SET "password_digest" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = 4  [["password_digest", "$2a$10$ZDhXd9OdtfXGAewWq56E6OgfAi0b99jCbcwHhv7yK75v65e9u5yvC"], ["admin", "true"], ["updated_at", Sat, 04 Apr 2015 01:56:34 UTC +00:00]]