app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (title like '%cinder%') ORDER BY created_at DESC

   def create
        @movie = Movie.new(movie_params)

        if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "director", "image", "poster_image_url", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])

    if @movie.update_attributes(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "runtime_in_minutes" = ?, "image" = ?, "updated_at" = ? WHERE "movies"."id" = 2  [["runtime_in_minutes", 22], ["image", "Elsa-Jack-Frost-image-elsa-and-jack-frost-36754134-262-420.jpg"], ["updated_at", Fri, 03 Apr 2015 23:12:58 UTC +00:00]]